package javarush.syntax.level3;
/*
Вывести на экран дату своего рождения в виде:
MAY 1 2012

Требования:
•	Выводимый текст должен содержать месяц, день и год, разделенные пробелом.
•	Название месяца должно выводиться на английском языке и заглавными буквами.
•	Год должен состоять из четырех цифр и быть не меньше 1900.
•	Дата рождения должна предшествовать текущей.
 */

public class IWasBornSoLongAgo {
    public static void main(String[] args){

        System.out.println("MAY 29 1981");
    }
}
