package javarush.syntax.level5;
/*
Написать программу, которая:
1. считывает с консоли число N, которое должно быть больше 0
2. потом считывает N чисел с консоли
3. выводит на экран максимальное из введенных N чисел.

Требования:
•	Программа должна считывать числа с клавиатуры.
•	Программа должна выводить число на экран.
•	В классе должен быть метод public static void main.
•	Нельзя добавлять новые методы в класс Solution.
•	Программа должна выводить на экран максимальное из введенных N чисел.
 */

import java.io.BufferedReader;
import java.io.InputStreamReader;

public class Algorithm23x10x2019 {
    public static void main(String[]args) throws Exception{
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        int maximum = ;

        System.out.println(maximum);
    }
}
